Repository: flutter/super_dash
Catalog: lib/l10n/arb/app_*.arb
Languages: pt

# gameIntroPageHeadline
source: Fly into Super Dash, avoid the bugs, collect points, and see how far you can go!
pt: Voe no Super Dash, evite os bugs, colete pontos e veja o quão longe você pode ir!

# gameIntroPagePlayButtonText
source: Play
pt: Jogar

# gameInstructionsPageAutoRunTitle
source: Dash Auto-runs
pt: Corrida Automática do Dash

# gameInstructionsPageAutoRunDescription
source: Welcome to Super Dash. In this game Dash runs automatically.
pt: Bem-vindo ao Super Dash. Neste jogo, o Dash corre automaticamente.

# gameInstructionsPageTapToJumpTitle
source: Tap to Jump
pt: Toque para Pular

# gameInstructionsPageTapToJumpDescription
source: Tap the screen to make Dash jump.
pt: Toque na tela para fazer o Dash pular.

# gameInstructionsPageTapToJumpDescriptionDesktop
source: Press spacebar to make Dash jump.
pt: Pressione a barra de espaço para fazer o Dash pular.

# gameInstructionsPageCollectEggsAcornsTitle
source: Collect Eggs & Acorns
pt: Colete Ovos e nozes

# gameInstructionsPageCollectEggsAcornsDescription
source: Get points by collecting eggs and acorns in the stage.
pt: Ganhe pontos coletando ovos e nozes no estágio.

# gameInstructionsPagePowerfulWingsTitle
source: Powerful Wings
pt: Asas Poderosas

# gameInstructionsPagePowerfulWingsDescription
source: Collect the golden feather to power up Dash with Flutter. While in midair, tap to do a double jump and see Dash fly!
pt: Colete a pena dourada para dar poder ao Dash com o Flutter. Enquanto estiver no ar, toque para dar um pulo duplo e veja o Dash voar!

# gameInstructionsPageLevelGatesTitle
source: Level Gates
pt: Portões de Nível

# gameInstructionsPageLevelGatesDescription
source: Advance through gates to face tougher challenges at higher stages.
pt: Avance pelos portões para enfrentar desafios mais difíceis nos estágios mais avançados.

# gameInstructionsPageAvoidBugsTitle
source: Avoid Bugs
pt: Evite os Bugs

# gameInstructionsPageAvoidBugsDescription
source: No one likes bugs! Jump to dodge them and avoid taking damage.
pt: Ninguém gosta de bugs! Pule para desviá-los e evite receber dano.

source: Mobile Apps Coming Soon
pt: Apps Móveis em Breve

# mobileAppsComingSoonGrabThe
source: Grab the
pt: Pegue o

# mobileAppsComingSoonMobileSourceCode
source: mobile source code
pt: código-fonte móvel

# mobileAppsComingSoonDescription
source: in the repo and look for the apps available for download in stores soon! Open this link on a desktop web browser to play today.
pt: no repositório e procure pelos aplicativos disponíveis para download em breve nas lojas! Abra este link em um navegador web de desktop para jogar hoje.

source: How it's made
pt: Como é feito

source: About Super Dash
pt: Sobre o Super Dash

source: Learn
pt: Aprenda

source: how we built Super Dash
pt: como construímos o Super Dash

source: in Flutter and grab the
pt: no Flutter e pegue o

source: open source code.
pt: código aberto.

source: Other Links
pt: Outros Links

source: Flutter Games
pt: Jogos Flutter

source: Privacy Policy
pt: Política de Privacidade

source: Terms of Service
pt: Termos de Serviço

source: Enter
pt: Entrar

# initialsBlacklistedMessage
source: Keep it PG, use different initials
pt: Mantenha PG, use iniciais diferentes

# initialsErrorMessage
source: Please enter three initials
pt: Por favor, insira três iniciais

# scoreSubmissionErrorMessage
source: There was an error submitting your score
pt: Houve um erro ao enviar sua pontuação

# shareYourScore
source: Share your Super Dash score and challenge your friends to do more!
pt: Compartilhe sua pontuação do Super Dash e desafie seus amigos a fazerem mais!

source: Share on:
pt: Compartilhar em:

source: Share
pt: Compartilhar

source: See the ranking
pt: Ver o ranking

source: Game over!
pt: Fim de Jogo!

source: Better luck next time.
pt: Boa sorte na próxima vez.

source: Total Score
pt: Pontuação Total

source: Submit score
pt: Enviar pontuação

source: Play again
pt: Jogar Novamente

# leaderboardPageLeaderboardHeadline
source: Leaderboard
pt: Placar

# leaderboardPageLeaderboardErrorText
source: There was an error while fetching the leaderboard.
pt: Houve um erro ao buscar o placar.

# leaderboardPageLeaderboardNoEntries
source: No entries
pt: Sem entradas

# leaderboardPageGoBackButton
source: Go back
pt: Voltar

# tapToStart
source: Tap/press Space to start
pt: Toque/pressione Espaço para começar

# downloadAppMessage
source: Fly into Super Dash, avoid the bugs, collect points, and see how far you can go!
pt: Voe no Super Dash, evite os bugs, colete pontos e veja o quão longe você pode ir!

# downloadAppLabel
source: Download the app
pt: Baixe o aplicativo
